app/controllers/api/events_controller.rb

SELECT  "events".* FROM "events" WHERE (Location is 'ONLINE') LIMIT $1  [["LIMIT", 11]]
---
  def getByType
    col = params[:column]
    val = params[:value]
    if col == 'any_id'
      @events = Event.where('id = ?', val)

      if session[:suggestions]

      else
        session[:suggestions] = {}
        session[:suggestionCount] = 0
      end
      event_object = @events.all.to_a.first