app/controllers/api/events_controller.rb

  def index
    if logged_in?
      @events = Event.where('start >= ?', DateTime.now)
      .where("creator_id != ?", current_user.id)
    else
      @events = Event.where('start >= ?', DateTime.now)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def create
    @event = Event.new(event_params)
    @event.creator_id = current_user.id

    if @event.save
---
INSERT INTO "events" ("title", "category_id", "location", "venue", "recurring", "start", "end", "timezone", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    @event = Event.find_by(id: params[:event][:id])
    if @event
      if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "events" SET "description" = $1, "about" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["description", "111111"], ["about", "AAAAAAAA"], ["updated_at", "2021-02-18 06:55:41.134959"], ["id", 26]]

  def getByType
    col = params[:column]
    val = params[:value]
    if(col == 'creator_id')
      @creator_id = val
      @events = Event.where("#{col} = ?", val) if whitelist(col.downcase)
---
SELECT "events".* FROM "events" WHERE (Location is 'ONLINE')