app/controllers/api/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "000"], ["LIMIT", 1]]
---
  def find
    debugger
    @user = User.find_by(email: params[:email])